In [2]:
import numpy as np
import pandas as pd

In [3]:
arr = np.random.randint(0,100,(5,5))

In [4]:
arr

array([[33, 65, 14, 19, 61],
       [35, 61,  8, 48, 18],
       [18,  0, 49, 18, 64],
       [50, 42, 50, 62, 69],
       [92,  2, 45,  6, 37]])

In [9]:
ser = pd.DataFrame(arr)

In [10]:
ser

    0   1   2   3   4
0  33  65  14  19  61
1  35  61   8  48  18
2  18   0  49  18  64
3  50  42  50  62  69
4  92   2  45   6  37

In [19]:
ser>50

       0      1      2      3      4
0  False   True  False  False   True
1  False   True  False  False  False
2  False  False  False  False   True
3  False  False  False   True   True
4   True  False  False  False  False

In [24]:
ser[ser>50]

      0     1   2     3     4
0   NaN  65.0 NaN   NaN  61.0
1   NaN  61.0 NaN   NaN   NaN
2   NaN   NaN NaN   NaN  64.0
3   NaN   NaN NaN  62.0  69.0
4  92.0   NaN NaN   NaN   NaN

In [44]:
ser[ser>50].isna().sum()

0    4
1    3
2    5
3    4
4    2
dtype: int64